<style lang="scss">
  .list {
    font-size: .14rem;
    .item {
      float: left;
      width: 10em;
      padding: 0 1em;
      margin: 0 .05rem .1rem;
      font-size: .14rem;
      line-height: 2.5;
      border-radius: 4px;
      color: #fff;
      border: 1px solid transparent;
      input {
        width: 100%;
        background: transparent;
      }
    }
  }
  $errorColor: #f56c6c;
  $forgiveColor: #67c23a;
  .v-list {
    border: 1px solid #ccc;
    border-radius: 4px;
    li {
      // font-size: 12px;
      line-height: 2;
      border-top: 1px solid #ccc;
      padding: 0 .5em;
      &:first-child {
        border: 0;
      }
    }
    &.diamond {
      li {
        &::before {
          content: '';
          display: inline-block;
          width: 5px;
          height: 5px;
          background: #777;
          transform: rotate(45deg);
          vertical-align: middle;
          margin-right: 5px;
          margin-top: -3px;
          border: 2px solid #777;
          border-color: #111 #444 #666 #999;
        }
        &.error {
          &::before {
            background: $errorColor;
            border-color: darken($errorColor, 20%) darken($errorColor, 10%) lighten($errorColor, 10%) lighten($errorColor, 20%);
          }
        }
        &.forgive {
          &::before {
            background: $forgiveColor;
            border-color: darken($forgiveColor, 15%) darken($forgiveColor, 8%) lighten($forgiveColor, 10%) lighten($forgiveColor, 20%);
          }
        }
      }
    }
  }
  // body::after {
  //   position: fixed;
  //   top: 0; left: 0;
  //   content: '';
  //   width: 100%;
  //   height: 100%;
  //   background-size: 100px 50px;
  //   pointer-events: none;
  // }
</style>

<template>
  <div class="list">
    <h2><span>List</span> <span class="chinese">列表</span></h2>
    <p>简单纯粹的列表.</p>
    <ul class="v-list diamond">
      <li v-for="i in rule" class="forgive" v-html="i"></li>
    </ul>
  </div>
</template>

<script>
  export default {
    data() {
      return {
        rule: ['名字被写入到死亡笔记上的人会死亡', '写名字的时候，如果不在脑中想著该人容貌的话，无效。因此，同名同姓的人不能一次全部被杀', '写完名字后如果在人间单位的40秒钟时间内写下死因的话，会依其发生', '不写死因的话全部默认为心脏麻痹而死', '写下死因时，会有额外6分40秒的时间可以记入详细的死亡情况', '死亡笔记从落到人间界的那一刻起就属於人类的东西', '死亡笔记的持有者可以识别死亡笔记的宿主死神的音貌', '使用过死亡笔记的人既不能升天堂也不能堕地狱', '将死因定为心脏麻痹後，如果在40秒的时间内写下具体的死亡时间的话。即使是心脏麻痹也可以操控死亡时间，甚至可以将时间定为那40秒以内', '接触到死亡笔记的人，即便不是死亡笔记持有者，也可以识别该死亡笔记的宿主死神的音貌', '只要持有死亡笔记，那麼会被宿主死神一直凭依到死为止', '宿主死神一般会在人类使用死亡笔记後的39天以内现身', '宿主死神原则上不给笔记使用者帮助或阻碍', '死神无义务向死亡笔记持有者说明有关死亡笔记的一切规则', '死神可以通过在死亡笔记上写名字延长自己的寿命，但人类却不能', '自己可以在死亡笔记上写自己的名字以缩短本人的寿命', '死亡笔记的持有者可以用自己剩下寿命的一半跟死神交换一双可以一看到人的容貌就知道其姓名和寿命的死神眼', '即使用刀或枪攻击死神的脑袋以及心脏也不能伤害到死神', '死亡状况的设定必须符合常理，必须是该人能力范围以内的事情', '连死神也不知道死亡状况能否实现的详细范围，所以必须自己去验证', '死亡笔记的一页或一小纸片，都具有死亡笔记的所有性质', '只要可以写出字迹，无论任何道具都可以来写死亡笔记。即便是化妆品或血等东西也没关系', '有关死亡笔记，即使是宿主死神也有很多不知道的事情', '先写死因和死亡状况，後写名字一样有效。不过这期间不能超过人间单位的19天', '即使不是死亡笔记的持有者，无论谁只要想著某人的样子并在死亡笔记上写他的名字也一样有效', '对出生未满780天的人，死亡笔记无效', '想著同一个人的样子，但四次写错该人的名字後，死亡笔记对其失效', '「自杀」也是有效的死因设定。几乎对於所有人类来说，自杀不属於没有被考虑过的范畴', '不管是自杀死还是事故死，都不能直接导致第三者的死亡。如果死亡状态将会导致第三者的死亡，那麼被写下名字的人只会在不导致第三者死亡的状态下心脏麻痹死', '写好名字、死亡时间和死亡状态後，在那6分40以内可以随意更改。当然，必须是在其死亡之前', '要在那6分40秒以内更改死亡时间或状态的话，首先在想改动的地方划两条横线', '虽然死亡时间和状态可以在上述范围内更改，不过一旦名字被写入到死亡笔记上，就肯定会死，没有任何方法可以取消', '死亡笔记丢失或被盗後490天以内不取回的话，自动丧失所有权', '交换了死神眼的人，在失去死亡笔记的所有权後，有关死亡笔记的记忆和死神眼的能力都会消失，但失去的寿命却不归还', '只要自己还有所有权，可以出借死亡笔记给其他人，二手出借也没问题', '宿主死神不会凭依借去死亡笔记的人。死神由始至终都只凭依拥有死亡笔记所有权的人。借用死亡笔记的人不能交换死神眼', '在死亡笔记被出借期间，如果死亡笔记的元所有者死亡的话，所有权会自动落在当时持有死亡笔记的人手里', '死亡笔记被盗的话，如果盗窃者杀害了死亡笔记的所有者，所有权也自动转移到盗窃者手里', '如果同一个人的名字被写到两本或更多的死亡笔记上，跟记入的死亡时间没关。只有最先写的那本笔记有效', '如果同一个人的名字被写到两本或更多的死亡笔记时的时间差不超过0.06秒，那麼该人不会死', '死神本身必须要持有一本死亡笔记，那本死亡笔记既不能给人类也不能让人类写', '死神之间可以交换死亡笔记，也可以使用对方的死亡笔记', '如果死神对特定的人持有好感，并为了要延长该人的寿命使用死亡笔记杀人的话，死神会死亡', '死神死後消失，但笔记会残留。其所有权通常会转移到捡到该死亡笔记的死神手里。但常识上应该将它交还给死神大王', '即使是同样持有死亡笔记的两人，在没有接触到对方的死亡笔记的情况下也无法识别对方死神的音貌', '拥有死神眼的虽然可以看到其他人的寿命和姓名，但是因为只能看到被取命者的寿命，而笔记持有者的身份是取命者而非被取命者，所以不能看到包括自己在内的拥有死亡笔记所有权的人的寿命', '死神不能告诉人类别人的姓名和寿命。以免在人间界引起混乱', '在人间界被使用的死亡笔记，最初必须是活著的死神的意志让人类使用才能生效', '虽然很难想像凭依的宿主死神会死，但如果死神死了，其落在人间界的那本死亡笔记的效果不变', '用死神眼看别人的姓名和寿命时，必须看到人脸的左右一半以上；上下的话，必须看到头顶到鼻子的部位，如果只是看到眼睛以下部位的话，无效。另外，眼睛、鼻子、口等其中一个部位被遮掩起来的话，也可以看到。至於被遮掩的部分占脸部的百分之几才会看不到姓名和寿命，这就有待死亡笔记的主人自己去验证了', '在上述情况OK的前提下，无论是多久远的照片和录像也可以看到该人的姓名和寿命，但根据大小和清晰度也有可能会看不到。另外，不管多麼仿真的绘画也是无效的', '持有死神眼的人类，不管之前视力是多少，一概变为3.6以上', '丧失死亡笔记所有权的人，关於死亡笔记的记忆会随之消失。但并不是指持有死亡笔记期间的所有记忆全部消失，自己的行为只是以跟死亡笔记没有牵连的自然状态继续存在', '如果持有两本或以上的死亡笔记的人，放弃其中一本後，会再也感知不到该死亡笔记的宿主死神。但只要手上还有一本笔记，有关所有死亡笔记的记忆不会消失', '死神不能无端滞留在人间界', '死神在人间界直接渡让死亡笔记时，不可直接将其交予人间单位不满6岁的小孩', '虽然死神不可直接将笔记渡让给未满6岁的小孩，但当笔记被掉在人间界时，就属於人间界的一部份，任何年龄的人使用的效果都是一样', '若只写上"事故死"的死因，而不写详细死亡状态的话，受害人会在6分40秒之後，在最短的时间内死於自然意外', '在「事故死」的情况下，即使当时只有被写入名字的人死亡，但是造成极大影响而事後牵连到他人死亡的话，也被视为违反规则只会死於心脏麻痹', '若在死亡笔记上死因写"病死"，并指明疾病的名称及死亡时间的话，一定要有足够时间让疾病生成。若时间太勉强，受害人只会在写完40秒後死於心脏麻痹', '死因为"病死"，但只指明死亡时间而没指定疾病种类的话，其会在指定时间内死於适当的疾病。 　但是，用死亡笔记能操纵的死亡时间最多只能有23日', '死因为"病死"，但只指定疾病种类而未指定死亡时间的话，若该病要在24日甚至以上才能令受害者死亡时，那「操纵的死亡时间最大为23天」的法则便不会产生效果，受害者会根据疾病在适当的时间死亡', '在上述的情况里，可以在6分40秒内更改死因及死亡状况。但无论怎样更改，死亡时间不变', '无法用死亡笔记杀超过人间单位124岁的人类', '无法用死亡笔记杀只馀人间单位12分钟以内寿命的人', '交换了死神眼，用其看到的人类寿命是与在人间界死亡笔记本无关的本来的寿命', '而且，用死神眼看到的名字是「杀该人所必要的名字」。即使该人在户籍上没有登记名字，也会看到为杀其而所需的名字', '无论写多少名字，死亡笔记的页数不会用尽', '若同时拥有两本或更多死亡笔记时，想著同一人的相貌， 　在其中一本死亡笔记上写下该人名字，而将死因及死亡状况写在另一本死亡笔记上，有效。 　同理，在一本死亡笔记上先写下死因，之後再在另一本上写下名字，同样有效', '上述情况也可在不同所有权的死亡笔记之间进行。但此时必须是在笔记所有者互相触碰对方的笔记的状态下', '如果失去死亡笔记所有权的话，便无法识别宿主死神的音貌。但之前触碰过死亡笔记的其他人还可以继续识别宿主死神的音貌', '在上述情况下，其他人因为触碰笔记而认知的有关死神以及笔记的记忆会一直存在，直到该人得到笔记所有权後又丧失为止', '笔记所有者不能被死神界的死神杀死', '以杀笔记所有人为目的而下凡的死神不能直接杀死该人', '只有把笔记渡让给人间界的死神才能杀死笔记所有人', '以逃避死亡笔记制裁为目的而故意将名字写错四次的人，会死亡', '被故意写错名字四次的人，日後依然可以被死亡笔记所杀', '虽然死神有雄性及雌性之分，但既不容许，也不可能够与人类发生性行为。死神之间也不进行性行为', '丢失了所有权的死亡笔记再度获得时，会恢复关於所有死亡笔记的全部记忆', '即使没有重获死亡笔记所有权，在触碰笔记的那一刻内会恢复记忆', '丧失死亡笔记所有权而失去记忆，又因为重获所有权或者触碰死亡笔记恢复记忆的次数，一本笔记最大为6次', '上述情况中，如果在6次之後再度获得死亡笔记所有权的话，会以无法恢复记忆的状态重新使用死亡笔记', '交易了死神眼的人，看已死亡的人的照片时，即看不到该人的名字也看不到其寿命', '死在人间界的死神所遗留下的死亡笔记，如果被人类拣到，就成为了人类的东西', '在上述这种情况时，只有能识别该死神音貌的人，才能看到并触摸到那本死亡笔记', '在死亡笔记上写下的名字，文字等，无法用橡皮，墨水消，修正液等消除', '在人间界的死亡笔记会改变人类的命运。即使没有被写入死亡笔记也有可能缩短寿命', '死神本身所拥有的死亡笔记不经意间掉落到人间界时，可以为取回死亡笔记而滞留在人间界', '如果此时，人间界还存在其他的死亡笔记的话，不能洩露那些死亡笔记的地点和所有者', '死神本身所拥有的死亡笔记被其他死神骗取等导致丢失的话，只能从凭依在那本死亡笔记的死神手里取回。如果其笔记没有凭依的死神而被人类所有时，只要触碰笔记就能凭依在该人身上。只有在该人死亡後，抢在其他人触碰笔记之前取回，或者该人直接返还死亡笔记', '死神祇要一次看到人类的相貌而得知其姓名和寿命的话，就可以从死神界的洞穴探知该人所在', '死神如果违反死神界戒律的话，会有从特级到八级共九种刑法。如果犯三级以上刑法，处以死刑', '因将死亡笔记的所有权转交给他人或放弃等原因，导致丧失关於此本笔记的记忆时，只限於在笔记写下姓名、杀过人的情况。仅仅是拥有过所有权并未写下姓名的话，关於那本笔记的记忆不消失。但是，因拥有所有权而能感知到的死神音貌，会因此无法继续感知', '死神即使不睡眠也不会死', '人间界同时存在的死亡笔记最多为6本', '一只死神，同时渡让笔记给不同的人类时，最多为三人', '将笔记渡让给三个人类时，可以采取让每人拥有两本笔记等手段', '人间界存在7本以上笔记时，只有最早渡让给人类的6本有效', '若非因烧毁等方式使笔记丧失效果，或由死神所有以及带回死神界的话，第7本笔记不发生效力'],
        src: ''
      };
    },
    methods: {},
    mounted() {
      // var canvas = document.createElement("canvas");
      // // var canvas = this.$refs.canvas;
      // canvas.width = 200;
      // canvas.height = 100;
      // canvas.style.width = canvas.width + 'px';
      // canvas.style.height = canvas.height + 'px';
      // var ctx = canvas.getContext("2d");
      // var devicePixelRatio = window.devicePixelRatio || 1;
      // var backingStoreRatio = ctx.webkitBackingStorePixelRatio ||
      //                     ctx.mozBackingStorePixelRatio ||
      //                     ctx.msBackingStorePixelRatio ||
      //                     ctx.oBackingStorePixelRatio ||
      //                     ctx.backingStorePixelRatio || 1;
      // var ratio = devicePixelRatio / backingStoreRatio;
      // console.log(ratio);
      // canvas.width = canvas.width * ratio;
      // canvas.height = canvas.height * ratio;
      // ctx.scale(ratio, ratio);
      // ctx.translate(0.5, 0.5);
      // ctx.globalAlpha = 0.5;
      // ctx.fillStyle = '#ffff00';
      // ctx.font = "bolder 16px Helvetica, Arial, sans-serif";
      // ctx.fillText("CodePlayer+中文测试", 0, 16);
      // this.src = canvas.toDataURL("image/png");
      // var style = document.createElement("style");
      // // style.type='text/css';
      // style.innerHTML = `body::after {background-image: url(${this.src});}`;
      // document.head.appendChild(style);
    }
  }
</script>
